{
    "items": [
        {
            "dateUtc": "2020-07-30T13:42:13.1521431Z",
            "id": "e6693e22-faa1-4711-93ad-82246302f6ce",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48480004",
                "symbol": "EURUSD",
                "profit": null,
                "isClosed": false,
                "side": "BUY",
                "takeProfit": 1.185900,
                "stopLoss": 1.177100,
                "entryPrice": 1.18069
            }
        },
        {
            "dateUtc": "2020-07-30T11:07:14.2097475Z",
            "id": "7b8e9b3c-74ad-4551-814b-41f46af9b1e0",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": "https://editorial.blob.core.windows.net/images-input/Signals/Chart of the Day 5-637317040022363738.png",
                "description": "<p>We still see the 114.80 as a good attractor for the CHFJPY because of the several technical indicators clustering around 114.76. See the Confluence Meter.&nbsp;More studies at the below link (change the pair in the URL to see other pairs&#39; studies).</p>\n",
                "link": "https://www.fxstreet.com/rates-charts/chfjpy"
            }
        },
        {
            "dateUtc": "2020-07-30T10:42:38.9260687Z",
            "id": "4521e1f8-39a8-4163-ad91-b0d7966924e0",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": "https://editorial.blob.core.windows.net/images-input/Signals/Chart of the Day 4-637317025457825655.png",
                "description": "<p>Some considerations on the CAD for the coming weeks and months:</p>\n\n<p>CAD bearish - Canada&#39;s oil industry lagging its competitors</p>\n\n<p>Canada&#39;s oil industry has been lagging its competitors for years. Long before anyone heard of a virus called Covid-19, Canadian crude was selling at a fraction of the price compared to WTI. This is due to the fact that the cost of shipping Canadian oil to refineries makes it much less economically viable than say, Saudi or Russian oil. With little hope for a pipeline linking Alberta&#39;s tar sands to the Southern United States, Canada&#39;s policy makers will need to get created if they hope to replace the loss in productivity which is surely going to drag on the energy sector as the globe recovers from the deep recession of 2020.</p>\n\n<p><br />\nCAD bearish - Canada&#39;s leveraged financial system</p>\n\n<p>[...] we can say with confidence that given Canada&#39;s GDP composition, the nation&#39;s economy will rebound much slower than other G-20 powers. This statement is hard to argue, given that on top of Canada&#39;s oil woes they also have one of the most levered financial systems. In the chart below &quot;Canada&#39;s GDP composition,&quot; we can see that real estate and construction also account for a huge portion of Canada&#39;s GDP. Compared to the United States, Canada is approximately twice as reliant on construction for jobs and much more reliant on real estate as an economic growth driver.</p>\n\n<p><br />\nCAD bearish - BoC&#39;s balance sheet over 30% of GDP</p>\n\n<p>[...] a shocking amount of central bank stimulus being needed to prop up the Canadian economy. As a percentage of GDP, the BoC&#39;s balance sheet has ballooned to over 30%, compared to just 7% pre-pandemic. Add to the staggering BoC balance sheet expansion the fact that Canada&#39;s fiscal deficit will be at least 20% of GDP this year, and we need not go into further detail to understand why there may be some serious implications for the Canadian dollar in the coming months and years.</p>\n\n<p>&nbsp;</p>\n",
                "link": "https://www.fxstreet.com/analysis/global-recession-canadas-economy-and-dollar-in-focus-video-202007300647"
            }
        },
        {
            "dateUtc": "2020-07-30T09:56:11.3852752Z",
            "id": "198ffff9-8593-41a5-830a-d9d419775b00",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": null,
                "description": "<p>We totally agree with Mike &ldquo;Mish&rdquo; Shedlock&#39;s, Sitka Pacific Capital Management,Llc, that the deterioration of trust in central banks (not only in the Fed) will be priced in the markets in the second half of 2020 and into 2021:</p>\n\n<p>&quot; As far as &quot;whatever it takes&quot;, there is essentially nothing shocking or new in today&#39;s announcements.</p>\n\n<p>Contrast this effort to the ECB and its bond crisis in 2012.</p>\n\n<p>On July 26, 2012, ECB president Mario Draghi gave a famous speech that rocked the European bond markets.</p>\n\n<p>&quot;Within our mandate, the ECB is ready to do whatever it takes to preserve the euro. And believe me, it will be enough.&quot;</p>\n\n<p>Q: So what did Draghi do?&nbsp;</p>\n\n<p>A: Absolutely nothing.&nbsp;</p>\n\n<p>The ECB did not start QE until years later.</p>\n\n<p>However, bond yields on Italian, Portuguese, Greek, and Spanish bonds plunged. A freefall in the price of gold lasted for years.</p>\n\n<p>Although the ECB took no direct actions, Draghi&#39;s speech restored confidence in the ECB.</p>\n\n<p>Doing nothing worked for the ECB. Doing nothing will do nothing for the Fed.&quot;</p>\n",
                "link": "https://www.fxstreet.com/analysis/feds-whatever-it-takes-moment-is-a-big-flop-202007291922"
            }
        },
        {
            "dateUtc": "2020-07-30T09:21:51.7944153Z",
            "id": "a8e923a9-38a5-4731-929b-da4149823c41",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": null,
                "description": "<p>Remember, as part of the service you may drop us questions using direct messages. We can&#39;t offer personalized trade recommendations, but we can answer all kinds of doubts, offer educational insights, and share our experience.</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-30T08:57:06.4923036Z",
            "id": "521e27cb-3811-4094-a326-51e694202c51",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": "https://editorial.blob.core.windows.net/images-input/Signals/Chart of the Day 3-637316962244881542.png",
                "description": "<p>On the other side of the spectrum, the JPY was unable to reach pre-covid-panic levels (marked with a &quot;?&quot; on the chart), and is now back inside its ascending price structure again. We expect to see an impulsive 5 to 7 wave ascending move towards the upper resistance level into August. It&#39;s still early to jump in, as similar bullish candles have been printed in recent days with no follow through. Let&#39;s be cautious and buy pullbacks in a possible rise, instead of breakouts.</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-30T08:39:02.2981952Z",
            "id": "ebc3ac35-ff16-4308-b5c5-38208b8fd1bb",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": "https://editorial.blob.core.windows.net/images-input/Signals/Chart of the Day 2-637316951410587480.png",
                "description": "<p>In recent weeks we had to endure a few intra-trade drawdowns in our AUD short commitments. These have now recovered to better levels. As you can see in the below chart, should the AUD trade below its ascending channel structure, the gap to the downside can be considerable, taking it to the June lows again. We will use the price action on the AUD index to eventually open new trades on AUD-based pairs, targeting the aforementioned June support.</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-30T07:41:25.6594185Z",
            "id": "48b9206e-3491-406c-8a1f-25b7faf60b11",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48450654",
                "symbol": "CHFJPY",
                "profit": null,
                "isClosed": false,
                "side": "SELL",
                "takeProfit": 114.800000,
                "stopLoss": 115.300000,
                "entryPrice": 114.999
            }
        },
        {
            "dateUtc": "2020-07-30T07:41:13.5146919Z",
            "id": "281a7e3d-655a-4b30-a10c-3100f12f14b0",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": null,
                "description": "<p>We go for selling the CHF against the JPY as we think the former will outperform the latter in strength during the day.</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-30T07:34:26.4912436Z",
            "id": "b396ca0b-0c3c-4b9c-8311-e03a315db170",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": "https://editorial.blob.core.windows.net/images-input/Signals/Chart of the Day 1-637316912652905616.png",
                "description": "<p>Current rankings, with JPY performing admirably as a safe heaven, USD also entrenched in the top spots, and high yielders AUD, NZD beginning the day on a sour note and NOK sliding 0.75% against all other major ccys.</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-29T19:00:06.0264191Z",
            "id": "09659df6-e2b9-46d6-9c5a-681560a50b41",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48416031",
                "symbol": "EURCAD",
                "profit": 0.001940,
                "isClosed": true,
                "side": "SELL",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 1.574350
            }
        },
        {
            "dateUtc": "2020-07-29T17:00:07.1540249Z",
            "id": "9686b7c7-4752-43b6-88bf-3032effbbe0c",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48390719",
                "symbol": "EURCHF",
                "profit": 0.002100,
                "isClosed": true,
                "side": "SELL",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 1.077600
            }
        },
        {
            "dateUtc": "2020-07-29T16:30:10.7693905Z",
            "id": "df44b75f-47e8-4bf1-a8be-76cf62b865a1",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48416029",
                "symbol": "NZDCHF",
                "profit": null,
                "isClosed": false,
                "side": "BUY",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 0.60755
            }
        },
        {
            "dateUtc": "2020-07-29T16:30:10.7685866Z",
            "id": "a0d00eb8-752b-4c8c-bb0e-49697b236b67",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48416031",
                "symbol": "EURCAD",
                "profit": null,
                "isClosed": false,
                "side": "SELL",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 1.57435
            }
        },
        {
            "dateUtc": "2020-07-29T15:01:04.9425165Z",
            "id": "c332a758-53ed-4e56-bf09-4c0630e9d72f",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": null,
                "description": "<p>European currencies on the rise right now, with NOK leading, followed by EUR, CHF and SEK, in this order. Because EUR is outperforming SEK, we see our long entry EURSEK (ID 47592178) weil into profits now.</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-29T14:25:06.0747419Z",
            "id": "2fed169a-9843-4092-8f38-3e9c6da164a4",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": null,
                "description": "<p>An interesting macro view from Alexander Kuptsekevich from FxPro Financial Services Limited on the USD: &nbsp;&quot;The debt markets pay just as much attention to this event. In recent days there has been more talk of the Dollar losing its &quot;exorbitant privilege&quot;. [...]&nbsp;</p>\n\n<p>Without the Fed&#39;s attention to the topic of the dollar weakening, the growth impulse of EURUSD may take it to 1.2000 in August and to 1.2500 by the end of the year. It is hard to take the discussion seriously that this is beneficial for American companies. After all, the USA is a net importer with a large trade deficit. A steady decline in the Dollar could quickly turn into pressure in the U.S. debt markets, which would put the Treasury in a challenging position.</p>\n\n<p>If the Fed speaks about this, then Chairman Powell will try to convince the world of stability at the press conference. Combined with excessively overheated sales of the U.S. currency in the last few weeks, this could lead to a confident retracement of the Dollar to 1.1000. This scenario is seen as being the most likely, as it will allow the U.S. Treasury to buy time for new rounds of borrowing in debt markets.</p>\n\n<p>It is unlikely for EURUSD to return to, or below 1.07 unless there is a repeat of March&#39;s markets disaster when demand for the Dollar swept away everything in its path.</p>\n\n<p>&nbsp;</p>\n\n<p>Source:</p>\n",
                "link": "https://www.fxstreet.com/analysis/the-state-of-the-dollar-is-in-the-hands-of-the-fed-a-backlash-or-deeper-drop-202007290802"
            }
        },
        {
            "dateUtc": "2020-07-29T14:13:35.0986445Z",
            "id": "c4b18ceb-8d48-494c-811e-345d8b8cf25c",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": null,
                "description": "<p>Any questions on our strategies, please feel free to direct message us. If you have an idea you would like to explore, you can also share it with us and can try to test its validity to transform it into a reliable trading system.</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-29T14:13:27.2121139Z",
            "id": "5cdd3df8-7149-47cf-9d81-808a6a4976e9",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": null,
                "description": "<p>The EUR and the CJF are traditionally very correlated. Both reflect inflows of capital into and out of Europe. But being two different currencies, the correlation is not perfect, and from time to time, one of the two currencies deviates from the other, just to come back to its correlation. Either the EUR recovers after a rally or the CHF pauses. The point is that both currencies do not spend much time without correcting its mutual deviations. In our desire to be a transparent signal service, we wanted to share this insight with you so you can explore his market inefficiency for yourself and exploit it.</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-29T14:13:19.8569354Z",
            "id": "1d68c735-52c9-404d-a56f-22b376cfb405",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": null,
                "description": "<p>The EURCHF has some particularities which make it work so well with the Spread Reversion strategy, especially the 30-minute version. Applied to this pair, the strategy reaches a win rate around 90%. This is very rare among trading strategies and suggests an over-optimized parametrization. While we keep an eye to the danger of the strategy to deteriorate from this winning rate levels, we also believe that the concept on which the strategy is based fits very well to this pair.</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-29T11:00:07.4719766Z",
            "id": "c16da7ce-d01f-4660-ac68-353c440c875c",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "47230839",
                "symbol": "AUDNZD",
                "profit": -0.012100,
                "isClosed": true,
                "side": "SELL",
                "takeProfit": 0.000000,
                "stopLoss": 0.000000,
                "entryPrice": 1.065770
            }
        },
        {
            "dateUtc": "2020-07-29T11:00:07.4481881Z",
            "id": "505502f5-7348-4bfb-b00c-da07fdfa486a",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48390719",
                "symbol": "EURCHF",
                "profit": null,
                "isClosed": false,
                "side": "SELL",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 1.0776
            }
        },
        {
            "dateUtc": "2020-07-29T10:57:26.7405042Z",
            "id": "5c6dca5d-98c7-447d-8785-d3c3a2fb8e05",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": null,
                "description": "<p>The reasons for dollar weakness, Giles Coghlan from HYCM:</p>\n\n<p>&quot;The further deterioration in the relationship between the US and China.</p>\n\n<p>The expanding COVID-19 case count in the US is showing that the US economy is likely to be slow coming out of lockdown.</p>\n\n<p>The general uncertainties around a November presidential election are keeping the USD sold.</p>\n\n<p>Increasing expectations that the Fed will need to cut policy rates further with the potential for yield curve control on the horizon.&quot;</p>\n\n<p>&nbsp;</p>\n\n<p>Source:&nbsp;</p>\n",
                "link": "https://www.fxstreet.com/analysis/dollar-set-for-the-worst-month-in-a-decade-202007290757"
            }
        },
        {
            "dateUtc": "2020-07-29T10:29:13.9464168Z",
            "id": "8c0df7a2-66f5-49bd-9c28-ec7dbefa5a6c",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": null,
                "description": "<p>Fiona Cincotta from CityIndex: &quot;Attention will now turn to the Federal Reserve, which is not expected to adjust monetary policy today. Broadly speaking US economic indicators had been improving since the last FOMC and had covid numbers stabilised or declined then the Fed would have been discussing an improving recovery. &nbsp;</p>\n\n<p>However, with Florida recording a record number of covid cases and Texas hitting the grim 400,000 cases milestone &ndash; the outlook is deteriorating. Furthermore, the two areas which are particularly problematic the Fed has no control over &ndash; these are firstly the rising number of coronavirus cases and secondly the government&rsquo;s fiscal response. &nbsp;</p>\n\n<p>Fed Powell warned over the economic uncertainty that lay ahead. With the situation rapidly deteriorating the Fed is expected to remain firmly dovish. The US Dollar&rsquo;s movement will depend largely on Jerome Powell&rsquo;s tone. &nbsp;<br />\nConcerns over the health of the US economy are already rife. A very cautious tone from the Fed could see the US Dollar sell off deepen and gold shoot higher. &quot;</p>\n\n<p><br />\nSource:</p>\n",
                "link": "https://www.fxstreet.com/analysis/stocks-slip-on-second-wave-fears-and-ahead-of-fed-202007290638"
            }
        },
        {
            "dateUtc": "2020-07-29T10:25:56.0238035Z",
            "id": "f88de180-8fc4-44c8-b32c-deb895300248",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": null,
                "description": "<p>The breakdown to new lows in the USD, reflected in many major pairs this morning, had so far no follow through, and many of those pairs are coming back to neutral oscillator readings. This hesitation is typical as you never know how the market may respond when it comes to the Fed announcements.&nbsp;</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-29T07:05:27.0955402Z",
            "id": "10aa2ccc-28da-450c-a37b-395276fb1012",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": "https://editorial.blob.core.windows.net/images-input/Signals/Chart of the Day 2-637316031260226916.png",
                "description": "<p>EURGBP is encountering resistance at the 0.9080 level, so we close manually the long trade ID 48347020</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-29T07:04:23.1631254Z",
            "id": "358418a7-33c0-4c12-841f-cf3a463e092f",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48347020",
                "symbol": "EURGBP",
                "profit": 0.000770,
                "isClosed": true,
                "side": "BUY",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 0.907010
            }
        },
        {
            "dateUtc": "2020-07-29T06:40:46.3711751Z",
            "id": "9d209db2-8201-4fad-8661-196b8732416b",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": "https://editorial.blob.core.windows.net/images-input/Signals/Chart of the Day 1-637316016428449021.png",
                "description": "<p>Except for emerging market currencies, there are no impressive moves so far today. Leaders EUR and AUD pairings with the underperformers GBP and USD are the ones showing larger movements.</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-29T02:45:06.897148Z",
            "id": "2c93cbd7-dd0a-4337-945c-c05649b2cf15",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48336753",
                "symbol": "EURCHF",
                "profit": 0.001420,
                "isClosed": true,
                "side": "BUY",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 1.074980
            }
        },
        {
            "dateUtc": "2020-07-29T01:30:15.6281762Z",
            "id": "db623f65-fe8a-415c-a3dd-dce987b3d13a",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48367219",
                "symbol": "AUDUSD",
                "profit": null,
                "isClosed": false,
                "side": "SELL",
                "takeProfit": 0.711222,
                "stopLoss": 0.721038,
                "entryPrice": 0.71613
            }
        },
        {
            "dateUtc": "2020-07-29T00:10:08.6700805Z",
            "id": "929dfd77-72bb-4a44-8254-f8b42e4a4831",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48001397",
                "symbol": "AUDCAD",
                "profit": 0.003490,
                "isClosed": true,
                "side": "BUY",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 0.955000
            }
        },
        {
            "dateUtc": "2020-07-28T14:30:04.6151213Z",
            "id": "67e9e3fd-88bf-4bfd-90e8-3b92c1084de3",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48347020",
                "symbol": "EURGBP",
                "profit": null,
                "isClosed": false,
                "side": "BUY",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 0.90701
            }
        },
        {
            "dateUtc": "2020-07-28T14:13:27.3714872Z",
            "id": "22b48cd0-280c-4aef-b389-8642deded424",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": null,
                "description": "<p>Except the NZDJPY, most our market indicators are still positioned for a risk-ON environment: the VIX for instance, known colloquially as the &quot;fear index,&quot; and a widely-used proxy for global risk aversion and for markets&#39; sensitivity to uncertainty, is at its molti-month base. Utilities do not repeat the June peak, but are still elevated. The NASDAQ, printing a lower high, but still at its highs. Base metals futures, which are especially sensitive to economic trends because they have a myriad of industrial applications are also close to its highs. Check these and other risk barometers here:</p>\n",
                "link": "https://www.fxstreet.com/technical-analysis/sentiment/risk-appetite"
            }
        },
        {
            "dateUtc": "2020-07-28T14:02:30.4271889Z",
            "id": "2f9e37a3-911c-4fa6-b38f-27e0f11510a1",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": null,
                "description": "<p>We prefer to abort this second EURCHF long for the reason mentioned- we are not yet at ideal support.</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-28T14:01:26.3286785Z",
            "id": "2eff19d7-b8e8-41a3-832f-a84a8b833b6d",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48343755",
                "symbol": "EURCHF",
                "profit": -0.000390,
                "isClosed": true,
                "side": "BUY",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 1.075060
            }
        },
        {
            "dateUtc": "2020-07-28T14:00:06.0694432Z",
            "id": "fef7125b-9cf0-433a-849e-f56ff0c4bfb2",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48343755",
                "symbol": "EURCHF",
                "profit": null,
                "isClosed": false,
                "side": "BUY",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 1.07506
            }
        },
        {
            "dateUtc": "2020-07-28T13:52:56.3174184Z",
            "id": "cea7f0a2-59de-4da1-88fc-83881a2dff20",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": null,
                "description": "<p>The oscillators usually featured on our charts are, on one hand the MACD set to 81, 36, 18 and the RSI set to 9 periods, all multiples of 9. By setting the MACD with larger moving averages, the indicator shows the directional movements better and their momentum. The RSI in turn, is shortened in its responsiveness from the traditional 14 period to 9, making it faster to capture reversals.&nbsp;&nbsp;</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-28T13:38:57.0985572Z",
            "id": "7547cdd3-9ade-43a5-a514-4763d30875b7",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": "https://editorial.blob.core.windows.net/images-input/Signals/Chart of the Day 4-637315403105555784.png",
                "description": "<p>Concerning the recent EURCHF short (ID 48336753): there is a risk for the EURCHF to recapture support as low as 0.0710. True, a brief relaxation could lift the cross 20 pips from here, and if that&#39;s the case we would prefer to take the money and close the trade.</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-28T13:00:06.1551634Z",
            "id": "febb6014-9a38-40c0-a226-cfedcd0b92c0",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48336753",
                "symbol": "EURCHF",
                "profit": null,
                "isClosed": false,
                "side": "BUY",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 1.07498
            }
        },
        {
            "dateUtc": "2020-07-28T11:40:08.2770406Z",
            "id": "6cd16659-2575-4d60-b5fe-473e4dfec1ec",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48200041",
                "symbol": "NZDCHF",
                "profit": 0.004910,
                "isClosed": true,
                "side": "SELL",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 0.615050
            }
        },
        {
            "dateUtc": "2020-07-28T10:49:30.7060771Z",
            "id": "dba2e36c-cc33-4288-9e8a-aebff1bda9da",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": "https://editorial.blob.core.windows.net/images-input/Signals/Chart of the Day 3-637315301236277320.png",
                "description": "<p>We can see a restoration of volatility post mid July and probably going into August if these movements expand to higher time frames. You can access the tool in this dedicated webpage:</p>\n",
                "link": " https://www.fxstreet.com/technical-analysis/volatility"
            }
        },
        {
            "dateUtc": "2020-07-28T10:26:51.2218248Z",
            "id": "c04cee41-a230-492a-ae72-ed336a4d8cce",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": "https://editorial.blob.core.windows.net/images-input/Signals/Chart of the Day 2-637315287368904685.png",
                "description": "<p>Our NZDCHF short triggered yesterday by the Spread Reversion 4H strategy may soon reach its target. The strategy entered short at 0.6150 and its dynamic exit levels imply take profit should come anytime. Coincidentally the pair is just a shade above a multi-month ascending trendline (now support) around 0.6100. The amount of demand we saw at this level on the opening yesterday may be removed now, and the downside vulnerability increases. A break below the mentioned line communicates risks for the downward trajectory initiated in March to resume into August.</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-28T09:56:25.0872935Z",
            "id": "cbcee7b3-baf6-4326-87a8-e95d329fa4c0",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": "https://editorial.blob.core.windows.net/images-input/Signals/Chart of the Day 1-637315269817307789.png",
                "description": "<p>Intraday RSI measures have nudged into oversold territory in many JPY-quoted pairs. Normally we would be on alert for some mean reversion signals to kick in. While this may be well the case, looking at longer-term charts, the technical landscape augurs bigger movements. Recall our messages from yesterday saying the next cyclical trend in change is ostensibly due these days. We are therefore more inclined to sell JPY pairs on advances and let those trades run, than buy oversold pairs for the risk for these pairs to remain severely depressed increases.</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-28T07:25:08.4561252Z",
            "id": "e4e1e5c0-90a3-41d2-ae9f-67007ba667d4",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": null,
                "description": "<p>Here is what you need to know today, Tuesday July 28:<br />\nThe US dollar witnessed fresh signs of life on Tuesday, as it staged a solid comeback across its main competitors. The greenback retraced some of its previous declines, helped by the souring sentiment on the Asian equities.<br />\nAlso, expectations that the US stimulus could be unveiled before the unemployment benefits expire on Friday, aided the dollar recovery ahead of Wednesday&rsquo;s all-important FOMC decision.<br />\nThe sharp pullback in the dollar, downed gold nearly $35 from its new record high of $1981.34, as investors took profits off the table after the relentless rise. Coronavirus-led economic concerns, dovish Fed expectations and US-China escalation will continue to benefit the yellow metal.<br />\nThe US Treasury yields rebounded while S&amp;P 500 futures pared back gains despite the coronavirus vaccine optimism. On Monday, Moderna Inc and Pfizer Inc announced a launch of two 30,000-subject trials of COVID-19 vaccines that could pave the way for the widespread use by the end of this year.<br />\nAmid a fresh dollar&rsquo;s buying-wave, EUR/USD fell from near 1.1770 levels while GBP/USD eased back below 1.2850, uninspired by UK-US trade deal hopes, as Brexit uncertainty continue to loom. USD/JPY recovered in tandem with the greenback, as the bulls regained the 105.50.<br />\nCommodity-currencies suffered, on the other hand, with NZD/USD losing the most, around 0.6650. AUD/USD faced rejection near 15-month highs of 0.7183 and dropped sharply towards 0.7100 while USD/CAD advanced towards 1.3400, additionally helped by the weakness in WTI. &nbsp;&nbsp;<br />\nCryptocurrencies consolidated the previous surge, with Bitcoin battling $11K mark.</p>\n",
                "link": ""
            }
        },
        {
            "dateUtc": "2020-07-28T06:45:10.5674153Z",
            "id": "dec94f05-5034-4660-b2b7-1d5d1f330846",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48187510",
                "symbol": "EURCHF",
                "profit": 0.002480,
                "isClosed": true,
                "side": "SELL",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 1.082330
            }
        },
        {
            "dateUtc": "2020-07-28T03:55:08.5525109Z",
            "id": "f155fa10-1acd-4624-a61c-a9e3a3f928a4",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48179672",
                "symbol": "EURCHF",
                "profit": 0.001980,
                "isClosed": true,
                "side": "SELL",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 1.082940
            }
        },
        {
            "dateUtc": "2020-07-27T18:40:06.7884282Z",
            "id": "27616d19-5d1a-4bc7-b2a6-7529323d41a5",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48184841",
                "symbol": "EURAUD",
                "profit": 0.001970,
                "isClosed": true,
                "side": "SELL",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 1.646820
            }
        },
        {
            "dateUtc": "2020-07-27T16:00:08.137623Z",
            "id": "921da043-a66c-45f5-abf5-91fbcafc9f82",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48196749",
                "symbol": "EURCAD",
                "profit": 0.002700,
                "isClosed": true,
                "side": "SELL",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 1.575390
            }
        },
        {
            "dateUtc": "2020-07-27T15:00:07.5151577Z",
            "id": "9ab6013a-b627-42c9-8666-1e8aba5040a1",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48200041",
                "symbol": "NZDCHF",
                "profit": null,
                "isClosed": false,
                "side": "SELL",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 0.61505
            }
        },
        {
            "dateUtc": "2020-07-27T14:50:17.9892517Z",
            "id": "0c23a13b-08e8-4abb-a547-b77aa038cf97",
            "contentType": "editorial",
            "content": {
                "title": "",
                "imageUrl": null,
                "description": "<p>We would like to hedge our brearish preferences with a more optimistic outlok on equities, coming from Monica Kingsley, Sunshine Profits:<br />\n&quot;...Friday&#39;s S&amp;P 500 setback hasn&#39;t materially changed the optimistic stock outlook, and the balance of signals from related markets still keeps more than slightly favoring the bulls. Technology is the joker, the wild card that would decide the S&amp;P 500 direction in the short run, and either prolong this two-day decline, or let stocks slowly but surely regain their footing, which they seem bound to do still.&quot;<br />\nSource:</p>\n",
                "link": "https://www.fxstreet.com/analysis/technology-is-holding-the-key-to-the-next-sp500-move-202007271234"
            }
        },
        {
            "dateUtc": "2020-07-27T14:30:08.7082652Z",
            "id": "93ea9f6b-578f-48a0-886a-831a39bf748c",
            "contentType": "trade",
            "content": {
                "positionMaintenanceId": "48196749",
                "symbol": "EURCAD",
                "profit": null,
                "isClosed": false,
                "side": "SELL",
                "takeProfit": null,
                "stopLoss": null,
                "entryPrice": 1.57539
            }
        }
    ],
    "pageNumber": 1,
    "pageSize": 50,
    "total": 332
}